In [116]:
import pandas as pd

# Merge Demo  using pandas

The example is taken from Python Datascience Handbook.

In [117]:
pop = pd.read_csv('sample_data/state-population.csv')

In [118]:
areas = pd.read_csv('sample_data/state-areas.csv')

In [119]:
state_abb = pd.read_csv('sample_data/state-abbrevs.csv')

In [120]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [121]:
areas.head()

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [122]:
state_abb.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [123]:
pop_state = pop.merge(state_abb, how = 'outer',left_on='state/region' , right_on='abbreviation').drop('abbreviation',axis=1)
pop_state.head(10)

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama
5           AL    total  2011   4801627.0  Alabama
6           AL    total  2009   4757938.0  Alabama
7           AL  under18  2009   1134192.0  Alabama
8           AL  under18  2013   1111481.0  Alabama
9           AL    total  2013   4833722.0  Alabama

In [124]:
#inspecting NULLs 

pop_state.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [125]:
# therefore population and state columns are null for some of them!
# lets see the which row doesnot have 'population' value!

pop_state[pop_state['population'].isnull()]

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN
2453           PR  under18  1993         NaN   NaN
2454           PR  under18  1992         NaN   NaN
2455           PR    total  1992         NaN   NaN
2456           PR  under18  1994         NaN   NaN
2457           PR    total  1994         NaN   NaN
2458           PR    total  1995         NaN   NaN
2459           PR  under18  1995         NaN   NaN
2460           PR  under18  1996         NaN   NaN
2461           PR    total  1996         NaN   NaN
2462           PR  under18  1998         NaN   NaN
2463           PR    total  1998         NaN   NaN
2464           PR    total  1997         NaN   NaN
2465           PR  under18  1997         NaN   NaN
2466           PR    total  1999         NaN   NaN
2467           PR  under18  1999         NaN   NaN

In [126]:
  # Totoal rows like above 
  pop_state[pop_state['population'].isnull()].size

100

In [127]:
# lets see the which row doesnot have 'state' value!
pop_state[pop_state['state'].isnull()]

     state/region     ages  year   population state
2448           PR  under18  1990          NaN   NaN
2449           PR    total  1990          NaN   NaN
2450           PR    total  1991          NaN   NaN
2451           PR  under18  1991          NaN   NaN
2452           PR    total  1993          NaN   NaN
...           ...      ...   ...          ...   ...
2539          USA    total  2010  309326295.0   NaN
2540          USA  under18  2011   73902222.0   NaN
2541          USA    total  2011  311582564.0   NaN
2542          USA  under18  2012   73708179.0   NaN
2543          USA    total  2012  313873685.0   NaN

[96 rows x 5 columns]

In [128]:
# lets see the for whcih states abbreviation are not present!
# pop_state['state'].isnull() returns a series which contains boolean mask for state column
pop_state.loc[pop_state['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [129]:
# We can quickly fix these as we already know their values 

PR_filter = pop_state['state/region'] == 'PR'
USA_filter = pop_state['state/region'] == 'USA'

In [130]:
#this returns every thing related to Puerto Rico
pop_state.loc[PR_filter].head(5)

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [131]:
# lets assign value to state then 

pop_state.loc[PR_filter,'state'] = 'Puerto Rico'

In [132]:
#this check if it works 
pop_state.loc[PR_filter].head(5)

     state/region     ages  year  population        state
2448           PR  under18  1990         NaN  Puerto Rico
2449           PR    total  1990         NaN  Puerto Rico
2450           PR    total  1991         NaN  Puerto Rico
2451           PR  under18  1991         NaN  Puerto Rico
2452           PR    total  1993         NaN  Puerto Rico

In [133]:
# lets do same thing for USA

pop_state.loc[USA_filter,'state'] = 'United States'

In [134]:
# joining area DF with existing one to get our final dataset
finalDF = pop_state.merge(areas, on='state',how ='left')

In [135]:
finalDF.head(5)

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [136]:
#lets check whcih state has no area infomation 
finalDF.loc[finalDF['area (sq. mi)'].isnull(),'state'].unique()

array(['United States'], dtype=object)

In [137]:
#lets drop all null values
finalDF.dropna(inplace=True)

In [138]:
# just getting the age where its value is total
totalAgeOnlyFilter = finalDF['ages'] == 'total'
# adding new column only for age = total, under18 will contain null
finalDF.loc[totalAgeOnlyFilter,'pop_density'] =  finalDF['population'] / finalDF['area (sq. mi)']

In [139]:
finalDF.head(5)

  state/region     ages  year  population    state  area (sq. mi)  pop_density
0           AL  under18  2012   1117489.0  Alabama        52423.0          NaN
1           AL    total  2012   4817528.0  Alabama        52423.0    91.897221
2           AL  under18  2010   1130966.0  Alabama        52423.0          NaN
3           AL    total  2010   4785570.0  Alabama        52423.0    91.287603
4           AL  under18  2011   1125763.0  Alabama        52423.0          NaN

In [146]:
#pop density for 2010 
pop_den_2010_filter = (finalDF['ages'] == 'total') & (finalDF['year'] == 2010)

finalDF[pop_den_2010_filter].sort_values('pop_density',ascending=False)[['state','pop_density']].head(5)

                     state  pop_density
389   District of Columbia  8898.897059
2490           Puerto Rico  1058.665149
1445            New Jersey  1009.253268
1914          Rhode Island   681.339159
293            Connecticut   645.600649

# Another Approach using Query!

In [141]:
data_2010 = finalDF.query(" year == 2010 & ages =='total' ")

In [142]:
data_2010.set_index('state',inplace = True)

In [145]:
(data_2010['population']/data_2010['area (sq. mi)']).sort_values(ascending =False).head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64